cask_args appdir: '/Applications'

tap 'Homebrew/bundle'

brew  'zsh'

brew 'neovim'

brew 'python'
brew 'go'
brew 'node'

brew 'coreutils'
brew 'htop'
brew 'pstree'
brew 'socat'
brew 'tmux'
brew 'jq'
brew 'ctags'
brew 'ffmpeg'
brew 'imagemagick'
brew 'tree'
brew 'wget'
brew 'direnv'
brew 'ag'
brew 'fzf'
brew 'neofetch'
brew 'weechat'
brew 'nmap'
brew 'iproute2mac'
brew 'wireguard-tools'
brew 'p7zip'

brew 'podman'
brew 'kubernetes-cli'
brew 'kubernetes-helm'
brew 'helmfile'
brew 'kubectx'
brew 'rancher-cli'

brew 'terraform'
cask 'google-cloud-sdk'


tap 'homebrew/cask-fonts'

cask 'font-fantasque-sans-mono'
cask 'font-overpass'

brew 'openfortivpn'
cask 'linphone'

cask 'drawio'

cask 'kitty'
cask 'maccy'

cask 'slack'

cask 'wireshark'

cask 'microsoft-remote-desktop'
