cask_args appdir: '/Applications'

tap 'Homebrew/bundle'

brew  'zsh'

brew 'neovim'

brew 'python'
brew 'go'
brew 'node'

brew 'coreutils'
brew 'htop'
brew 'pstree'
brew 'socat'
brew 'tmux'
brew 'jq'
brew 'ctags'
brew 'ffmpeg'
brew 'imagemagick'
brew 'tree'
brew 'wget'
brew 'direnv'
brew 'ag'
brew 'fzf'

cask 'docker'
brew 'docker-completion'
brew 'kubernetes-cli'
brew 'kubernetes-helm'
brew 'helmfile'

brew 'terraform'
cask 'google-cloud-sdk'

tap 'homebrew/cask-fonts'

cask 'font-fantasque-sans-mono'
cask 'font-overpass'

cask 'kitty'
cask 'launchbar'

cask 'wireshark'
